In [1]:
#Import Pandas
import pandas as pd
from sqlalchemy import create_engine

In [2]:
#Read CSV
df = pd.read_csv('data.csv', parse_dates=True)

In [3]:
#Filter Columns
df = df[['IM_INCIDENT_KEY', 'INCIDENT_DATE_TIME', 'ARRIVAL_DATE_TIME', 'TOTAL_INCIDENT_DURATION', 'ACTION_TAKEN1_DESC', 'ACTION_TAKEN2_DESC', 'ZIP_CODE', 'BOROUGH_DESC']]

In [4]:
#Get All columns name
#df.columns

In [5]:
#Check memory Usage (6.1 MB)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119324 entries, 0 to 119323
Data columns (total 8 columns):
IM_INCIDENT_KEY            119324 non-null int64
INCIDENT_DATE_TIME         119324 non-null object
ARRIVAL_DATE_TIME          118636 non-null object
TOTAL_INCIDENT_DURATION    119324 non-null int64
ACTION_TAKEN1_DESC         119324 non-null object
ACTION_TAKEN2_DESC         115132 non-null object
ZIP_CODE                   119322 non-null float64
BOROUGH_DESC               119324 non-null object
dtypes: float64(1), int64(2), object(5)
memory usage: 7.3+ MB

In [6]:
#Reduce memory Usage (4.9 MB)
df['ACTION_TAKEN1_DESC'] = df['ACTION_TAKEN1_DESC'].astype('category')
df['ACTION_TAKEN2_DESC'] = df['ACTION_TAKEN2_DESC'].astype('category')
df['BOROUGH_DESC'] = df['BOROUGH_DESC'].astype('category')


df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119324 entries, 0 to 119323
Data columns (total 8 columns):
IM_INCIDENT_KEY            119324 non-null int64
INCIDENT_DATE_TIME         119324 non-null object
ARRIVAL_DATE_TIME          118636 non-null object
TOTAL_INCIDENT_DURATION    119324 non-null int64
ACTION_TAKEN1_DESC         119324 non-null category
ACTION_TAKEN2_DESC         115132 non-null category
ZIP_CODE                   119322 non-null float64
BOROUGH_DESC               119324 non-null category
dtypes: category(3), float64(1), int64(2), object(2)
memory usage: 4.9+ MB

In [7]:
# Drop NA Valus
df = df.dropna()
df.head(3)

,IM_INCIDENT_KEY,INCIDENT_DATE_TIME,ARRIVAL_DATE_TIME,TOTAL_INCIDENT_DURATION,ACTION_TAKEN1_DESC,ACTION_TAKEN2_DESC,ZIP_CODE,BOROUGH_DESC
2,63476614,06/30/2018 11:22:51 PM,06/30/2018 11:27:18 PM,995,86 - Investigate,45 - Remove hazard,10472.0,2 - Bronx
3,63476562,06/30/2018 11:05:55 PM,06/30/2018 11:11:39 PM,671,44 - Hazardous materials leak control & contai...,64 - Shut down system,10452.0,2 - Bronx
4,63476510,06/30/2018 10:53:15 PM,06/30/2018 10:58:49 PM,1384,44 - Hazardous materials leak control & contai...,64 - Shut down system,10463.0,2 - Bronx

In [8]:
# Get Columns Types
df.dtypes

IM_INCIDENT_KEY               int64
INCIDENT_DATE_TIME           object
ARRIVAL_DATE_TIME            object
TOTAL_INCIDENT_DURATION       int64
ACTION_TAKEN1_DESC         category
ACTION_TAKEN2_DESC         category
ZIP_CODE                    float64
BOROUGH_DESC               category
dtype: object

In [9]:
# Split Date/Time and export to a separate dataframe
INCIDENT_DATE_TIME = df["INCIDENT_DATE_TIME"].str.split(" ", n = 1, expand = True) 
ARRIVAL_DATE_TIME = df["ARRIVAL_DATE_TIME"].str.split(" ", n = 1, expand = True)

In [10]:
#Delete column in the original DF with the date and time combined (we will merge the new df)
del df['INCIDENT_DATE_TIME']
del df['ARRIVAL_DATE_TIME']

In [11]:
#Reset Indexes (they now start at two)

#First DF
df.reset_index(inplace=True, drop=True)

#Second DF
INCIDENT_DATE_TIME.reset_index(inplace=True, drop=True)

#Third DF
ARRIVAL_DATE_TIME.reset_index(inplace=True, drop=True)

In [12]:
#Rename new DF columns names

#Incident Date/time
INCIDENT_DATE_TIME.rename(columns={0: 'Incident Date', 1: 'Incident Time'}, inplace=True)

#Arrival Date/Time
ARRIVAL_DATE_TIME.rename(columns={0: 'Arrival Date', 1: 'Arrival Time'}, inplace=True)

In [13]:
# Join the two DFs
df = df.join(INCIDENT_DATE_TIME, how='outer')
df = df.join(ARRIVAL_DATE_TIME, how='outer')

In [14]:
df.head(3)

,IM_INCIDENT_KEY,TOTAL_INCIDENT_DURATION,ACTION_TAKEN1_DESC,ACTION_TAKEN2_DESC,ZIP_CODE,BOROUGH_DESC,Incident Date,Incident Time,Arrival Date,Arrival Time
0,63476614,995,86 - Investigate,45 - Remove hazard,10472.0,2 - Bronx,06/30/2018,11:22:51 PM,06/30/2018,11:27:18 PM
1,63476562,671,44 - Hazardous materials leak control & contai...,64 - Shut down system,10452.0,2 - Bronx,06/30/2018,11:05:55 PM,06/30/2018,11:11:39 PM
2,63476510,1384,44 - Hazardous materials leak control & contai...,64 - Shut down system,10463.0,2 - Bronx,06/30/2018,10:53:15 PM,06/30/2018,10:58:49 PM

In [15]:
#Import weather data frame and parse dates
df_weather = pd.read_csv("nycweatherdata.csv", parse_dates=True)
df_weather.head(3)

       STATION    DATE  TMAX  TMIN
0  USW00094728  1/1/13    40    26
1  USW00094728  1/2/13    33    22
2  USW00094728  1/3/13    32    24

In [16]:
# Rename column name/ we need to match the two columns name in the weather and our original df to join on
df_weather.rename(columns={'DATE': 'Incident Date'}, inplace=True)
df_weather.head(3)

       STATION Incident Date  TMAX  TMIN
0  USW00094728        1/1/13    40    26
1  USW00094728        1/2/13    33    22
2  USW00094728        1/3/13    32    24

In [17]:
# Convert the dates columns to date_time object to join on
df['Incident Date'] = pd.to_datetime(df['Incident Date'])
df_weather['Incident Date'] = pd.to_datetime(df_weather['Incident Date'])

In [18]:
# Join weather and our DF
final_df = df_weather.merge(df, on='Incident Date')

In [19]:
# Delete Station column (we don't need it)
del final_df['STATION']

In [20]:
# verify join worked fine
final_df.head(3)

,Incident Date,TMAX,TMIN,IM_INCIDENT_KEY,TOTAL_INCIDENT_DURATION,ACTION_TAKEN1_DESC,ACTION_TAKEN2_DESC,ZIP_CODE,BOROUGH_DESC,Incident Time,Arrival Date,Arrival Time
0,2013-01-01,40,26,55675645,1108,44 - Hazardous materials leak control & contai...,64 - Shut down system,10455.0,2 - Bronx,11:30:10 PM,01/01/2013,11:34:39 PM
1,2013-01-01,40,26,55675621,461,44 - Hazardous materials leak control & contai...,64 - Shut down system,10027.0,1 - Manhattan,11:14:24 PM,01/01/2013,11:19:08 PM
2,2013-01-01,40,26,55675611,829,44 - Hazardous materials leak control & contai...,64 - Shut down system,11207.0,4 - Brooklyn,11:08:08 PM,01/01/2013,11:10:30 PM

In [21]:
# Get rid of the .0 that is in the zip code column
final_df['ZIP_CODE'] = final_df['ZIP_CODE'].astype(int)

In [22]:
# Check zipcode formatting
final_df.head(3)

,Incident Date,TMAX,TMIN,IM_INCIDENT_KEY,TOTAL_INCIDENT_DURATION,ACTION_TAKEN1_DESC,ACTION_TAKEN2_DESC,ZIP_CODE,BOROUGH_DESC,Incident Time,Arrival Date,Arrival Time
0,2013-01-01,40,26,55675645,1108,44 - Hazardous materials leak control & contai...,64 - Shut down system,10455,2 - Bronx,11:30:10 PM,01/01/2013,11:34:39 PM
1,2013-01-01,40,26,55675621,461,44 - Hazardous materials leak control & contai...,64 - Shut down system,10027,1 - Manhattan,11:14:24 PM,01/01/2013,11:19:08 PM
2,2013-01-01,40,26,55675611,829,44 - Hazardous materials leak control & contai...,64 - Shut down system,11207,4 - Brooklyn,11:08:08 PM,01/01/2013,11:10:30 PM

In [23]:
#Remove numbers that are nex to the Bourough (Maps need only the name with no nums)
final_df['BOROUGH_DESC'] = final_df['BOROUGH_DESC'].map(lambda x: str(x)[4:])

In [24]:
final_df.head(3)

,Incident Date,TMAX,TMIN,IM_INCIDENT_KEY,TOTAL_INCIDENT_DURATION,ACTION_TAKEN1_DESC,ACTION_TAKEN2_DESC,ZIP_CODE,BOROUGH_DESC,Incident Time,Arrival Date,Arrival Time
0,2013-01-01,40,26,55675645,1108,44 - Hazardous materials leak control & contai...,64 - Shut down system,10455,Bronx,11:30:10 PM,01/01/2013,11:34:39 PM
1,2013-01-01,40,26,55675621,461,44 - Hazardous materials leak control & contai...,64 - Shut down system,10027,Manhattan,11:14:24 PM,01/01/2013,11:19:08 PM
2,2013-01-01,40,26,55675611,829,44 - Hazardous materials leak control & contai...,64 - Shut down system,11207,Brooklyn,11:08:08 PM,01/01/2013,11:10:30 PM

In [25]:
final_df = final_df.rename(columns = {"Incident Date": "Date",
                                 "Arrival Date":"Arrival_Date",
                                 "Arrival Time": "Arrival_Time",
                                    "Incident Time":"Incident_Time"})

In [26]:
final_df.head()

,Date,TMAX,TMIN,IM_INCIDENT_KEY,TOTAL_INCIDENT_DURATION,ACTION_TAKEN1_DESC,ACTION_TAKEN2_DESC,ZIP_CODE,BOROUGH_DESC,Incident_Time,Arrival_Date,Arrival_Time
0,2013-01-01,40,26,55675645,1108,44 - Hazardous materials leak control & contai...,64 - Shut down system,10455,Bronx,11:30:10 PM,01/01/2013,11:34:39 PM
1,2013-01-01,40,26,55675621,461,44 - Hazardous materials leak control & contai...,64 - Shut down system,10027,Manhattan,11:14:24 PM,01/01/2013,11:19:08 PM
2,2013-01-01,40,26,55675611,829,44 - Hazardous materials leak control & contai...,64 - Shut down system,11207,Brooklyn,11:08:08 PM,01/01/2013,11:10:30 PM
3,2013-01-01,40,26,55675547,1025,44 - Hazardous materials leak control & contai...,64 - Shut down system,11373,Queens,10:26:05 PM,01/01/2013,10:29:29 PM
4,2013-01-01,40,26,55675480,1054,44 - Hazardous materials leak control & contai...,64 - Shut down system,11360,Queens,09:33:56 PM,01/01/2013,09:39:20 PM

In [27]:
engine = create_engine('sqlite:///coned.db', echo=True)

In [28]:
final_df.to_sql('ConEdDB', con=engine, if_exists='replace')

2019-08-24 18:24:36,437 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2019-08-24 18:24:36,438 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,439 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2019-08-24 18:24:36,440 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,441 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("ConEdDB")
2019-08-24 18:24:36,441 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,443 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("ConEdDB")
2019-08-24 18:24:36,443 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,444 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2019-08-24 18:24:36,444 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,446 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("ConEdDB")
2019-08-24 18:24:36,446 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,448 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'ConEdDB' AND type = 'table'
2019-08-24 18:24:36,449 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,450 INFO sqlalchemy.engine.base.Engine PRAGMA foreign_key_list("ConEdDB")
2019-08-24 18:24:36,450 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,451 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'ConEdDB' AND type = 'table'
2019-08-24 18:24:36,452 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,454 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("ConEdDB")
2019-08-24 18:24:36,454 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,455 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("ix_ConEdDB_index")
2019-08-24 18:24:36,456 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,457 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("ConEdDB")
2019-08-24 18:24:36,457 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,459 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("ix_ConEdDB_index")
2019-08-24 18:24:36,459 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,461 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'ConEdDB' AND type = 'table'
2019-08-24 18:24:36,461 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,466 INFO sqlalchemy.engine.base.Engine
DROP TABLE "ConEdDB"
2019-08-24 18:24:36,466 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,647 INFO sqlalchemy.engine.base.Engine COMMIT
2019-08-24 18:24:36,649 INFO sqlalchemy.engine.base.Engine
CREATE TABLE "ConEdDB" (
	"index" BIGINT,
	"Date" DATETIME,
	"TMAX" BIGINT,
	"TMIN" BIGINT,
	"IM_INCIDENT_KEY" BIGINT,
	"TOTAL_INCIDENT_DURATION" BIGINT,
	"ACTION_TAKEN1_DESC" TEXT,
	"ACTION_TAKEN2_DESC" TEXT,
	"ZIP_CODE" BIGINT,
	"BOROUGH_DESC" TEXT,
	"Incident_Time" TEXT,
	"Arrival_Date" TEXT,
	"Arrival_Time" TEXT
)


2019-08-24 18:24:36,650 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,651 INFO sqlalchemy.engine.base.Engine COMMIT
2019-08-24 18:24:36,652 INFO sqlalchemy.engine.base.Engine CREATE INDEX "ix_ConEdDB_index" ON "ConEdDB" ("index")
2019-08-24 18:24:36,652 INFO sqlalchemy.engine.base.Engine ()
2019-08-24 18:24:36,654 INFO sqlalchemy.engine.base.Engine COMMIT
2019-08-24 18:24:36,767 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2019-08-24 18:24:38,324 INFO sqlalchemy.engine.base.Engine INSERT INTO "ConEdDB" ("index", "Date", "TMAX", "TMIN", "IM_INCIDENT_KEY", "TOTAL_INCIDENT_DURATION", "ACTION_TAKEN1_DESC", "ACTION_TAKEN2_DESC", "ZIP_CODE", "BOROUGH_DESC", "Incident_Time", "Arrival_Date", "Arrival_Time") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2019-08-24 18:24:38,325 INFO sqlalchemy.engine.base.Engine ((0, '2013-01-01 00:00:00.000000', 40, 26, 55675645, 1108, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 10455, 'Bronx', '11:30:10 PM', '01/01/2013', '11:34:39 PM'), (1, '2013-01-01 00:00:00.000000', 40, 26, 55675621, 461, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 10027, 'Manhattan', '11:14:24 PM', '01/01/2013', '11:19:08 PM'), (2, '2013-01-01 00:00:00.000000', 40, 26, 55675611, 829, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 11207, 'Brooklyn', '11:08:08 PM', '01/01/2013', '11:10:30 PM'), (3, '2013-01-01 00:00:00.000000', 40, 26, 55675547, 1025, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 11373, 'Queens', '10:26:05 PM', '01/01/2013', '10:29:29 PM'), (4, '2013-01-01 00:00:00.000000', 40, 26, 55675480, 1054, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 11360, 'Queens', '09:33:56 PM', '01/01/2013', '09:39:20 PM'), (5, '2013-01-01 00:00:00.000000', 40, 26, 55675481, 1515, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 10314, 'Staten Island', '09:33:49 PM', '01/01/2013', '09:38:23 PM'), (6, '2013-01-01 00:00:00.000000', 40, 26, 55675429, 2707, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 10019, 'Manhattan', '09:10:36 PM', '01/01/2013', '09:14:47 PM'), (7, '2013-01-01 00:00:00.000000', 40, 26, 55675384, 899, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 11221, 'Brooklyn', '08:40:27 PM', '01/01/2013', '08:42:33 PM')  ... displaying 10 of 114523 total bound parameter sets ...  (114521, '2018-06-30 00:00:00.000000', 93, 72, 63471515, 1794, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 10011, 'Manhattan', '01:51:36 AM', '06/30/2018', '01:57:10 AM'), (114522, '2018-06-30 00:00:00.000000', 93, 72, 63471300, 868, '44 - Hazardous materials leak control & containment', '64 - Shut down system', 10035, 'Manhattan', '01:04:51 AM', '06/30/2018', '01:09:36 AM'))
2019-08-24 18:24:38,769 INFO sqlalchemy.engine.base.Engine COMMIT
2019-08-24 18:24:38,807 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2019-08-24 18:24:38,807 INFO sqlalchemy.engine.base.Engine ()

In [29]:
# final_df['Date'] = final_df['Date'].astype(str)
# final_df.dtypes

In [30]:
final_df.to_csv("final_leaks.csv")

In [31]:
year_data = final_df[final_df['Date'].dt.year == 2013]

In [32]:
grouped = pd.DataFrame(year_data.groupby('ZIP_CODE').sum()['TMAX'])
grouped.rename(columns = {'TMAX': 'Total Leaks'}, inplace=True)
grouped.to_dict()

{'Total Leaks': {10001: 2376,
  10002: 11473,
  10003: 6140,
  10004: 651,
  10005: 38,
  10007: 992,
  10009: 10560,
  10010: 1993,
  10011: 3617,
  10012: 1668,
  10013: 3776,
  10014: 4310,
  10016: 3781,
  10017: 1566,
  10018: 1006,
  10019: 3612,
  10020: 69,
  10021: 5789,
  10022: 2521,
  10023: 3399,
  10024: 5977,
  10025: 8780,
  10026: 6365,
  10027: 12602,
  10028: 3029,
  10029: 15338,
  10030: 5702,
  10031: 7454,
  10032: 8142,
  10033: 3542,
  10034: 3835,
  10035: 9514,
  10036: 2562,
  10037: 3604,
  10038: 2588,
  10039: 5829,
  10040: 5320,
  10128: 4017,
  10280: 144,
  10301: 4702,
  10302: 1346,
  10303: 2380,
  10304: 4247,
  10305: 4409,
  10306: 5932,
  10307: 1019,
  10308: 1772,
  10309: 2062,
  10310: 2645,
  10312: 3985,
  10314: 5991,
  10451: 10677,
  10452: 6456,
  10453: 9817,
  10454: 9379,
  10455: 5100,
  10456: 16548,
  10457: 8623,
  10458: 8651,
  10459: 5314,
  10460: 7217,
  10461: 5586,
  10462: 6767,
  10463: 9437,
  10464: 819,
  10465: 6280,
  10466: 9031,
  10467: 14467,
  10468: 8278,
  10469: 10091,
  10470: 1608,
  10471: 1841,
  10472: 12380,
  10473: 11669,
  10474: 2142,
  10475: 9270,
  11004: 1162,
  11101: 7359,
  11102: 3909,
  11103: 4330,
  11104: 2434,
  11105: 3854,
  11106: 3512,
  11201: 6092,
  11203: 7406,
  11204: 3478,
  11205: 5614,
  11206: 13414,
  11207: 14719,
  11208: 10052,
  11209: 4433,
  11210: 4885,
  11211: 7960,
  11212: 19589,
  11213: 8043,
  11214: 3891,
  11215: 5436,
  11216: 8282,
  11217: 3479,
  11218: 3587,
  11219: 2549,
  11220: 2984,
  11221: 11883,
  11222: 2011,
  11223: 5533,
  11224: 7792,
  11225: 4225,
  11226: 8814,
  11228: 1839,
  11229: 6407,
  11230: 3904,
  11231: 7704,
  11232: 1524,
  11233: 13295,
  11234: 7110,
  11235: 6159,
  11236: 7966,
  11237: 4936,
  11238: 4956,
  11239: 1004,
  11251: 50,
  11354: 5122,
  11355: 3335,
  11356: 1293,
  11357: 2890,
  11358: 1968,
  11360: 1576,
  11361: 2426,
  11362: 2567,
  11363: 697,
  11364: 3664,
  11365: 4096,
  11366: 1036,
  11367: 4640,
  11368: 2466,
  11369: 1160,
  11370: 608,
  11372: 3025,
  11373: 2059,
  11374: 1922,
  11375: 3162,
  11377: 5124,
  11378: 1547,
  11379: 1101,
  11385: 4519,
  11411: 1534,
  11412: 2739,
  11413: 3006,
  11414: 1759,
  11415: 1156,
  11416: 1088,
  11417: 1028,
  11418: 2611,
  11419: 1100,
  11420: 1860,
  11421: 1487,
  11422: 1567,
  11423: 940,
  11426: 2644,
  11427: 2480,
  11428: 473,
  11429: 1176,
  11432: 4782,
  11433: 6714,
  11434: 4070,
  11435: 2815,
  11436: 1610,
  11691: 8072,
  11692: 1432,
  11693: 964,
  11694: 2012,
  11697: 1537,
  99999: 3646}}

In [33]:
month_data = year_data[year_data['Date'].dt.month == 1]
month_data = month_data[['Date', 'TMAX']]
# month_data['Date'] = pd.to_datetime(month_data['Date'], format = '%Y-%m-%d')
# month_data['Date'] = month_data['Date'].astype(str)
month_data.dtypes

Date    datetime64[ns]
TMAX             int64
dtype: object

In [34]:
month_data.groupby('Date')['TMAX'].max()
grouped_month = pd.DataFrame(month_data.groupby('Date')['TMAX'].max())
grouped_month.rename(columns = {'TMAX': 'Temp'}, inplace=True)
dic = grouped_month.to_dict()

final_dic = dic['Temp']
final_dic

{Timestamp('2013-01-01 00:00:00'): 40,
 Timestamp('2013-01-02 00:00:00'): 33,
 Timestamp('2013-01-03 00:00:00'): 32,
 Timestamp('2013-01-04 00:00:00'): 37,
 Timestamp('2013-01-05 00:00:00'): 42,
 Timestamp('2013-01-06 00:00:00'): 46,
 Timestamp('2013-01-07 00:00:00'): 45,
 Timestamp('2013-01-08 00:00:00'): 48,
 Timestamp('2013-01-09 00:00:00'): 49,
 Timestamp('2013-01-10 00:00:00'): 47,
 Timestamp('2013-01-11 00:00:00'): 46,
 Timestamp('2013-01-12 00:00:00'): 47,
 Timestamp('2013-01-13 00:00:00'): 50,
 Timestamp('2013-01-14 00:00:00'): 56,
 Timestamp('2013-01-15 00:00:00'): 38,
 Timestamp('2013-01-16 00:00:00'): 37,
 Timestamp('2013-01-17 00:00:00'): 43,
 Timestamp('2013-01-18 00:00:00'): 35,
 Timestamp('2013-01-19 00:00:00'): 51,
 Timestamp('2013-01-20 00:00:00'): 53,
 Timestamp('2013-01-21 00:00:00'): 32,
 Timestamp('2013-01-22 00:00:00'): 27,
 Timestamp('2013-01-23 00:00:00'): 20,
 Timestamp('2013-01-24 00:00:00'): 22,
 Timestamp('2013-01-25 00:00:00'): 24,
 Timestamp('2013-01-26 00:00:00'): 27,
 Timestamp('2013-01-27 00:00:00'): 34,
 Timestamp('2013-01-28 00:00:00'): 36,
 Timestamp('2013-01-29 00:00:00'): 49,
 Timestamp('2013-01-30 00:00:00'): 59,
 Timestamp('2013-01-31 00:00:00'): 61}

In [35]:
grouped_month.reset_index(level=0, inplace=True)
grouped_month

         Date  Temp
0  2013-01-01    40
1  2013-01-02    33
2  2013-01-03    32
3  2013-01-04    37
4  2013-01-05    42
5  2013-01-06    46
6  2013-01-07    45
7  2013-01-08    48
8  2013-01-09    49
9  2013-01-10    47
10 2013-01-11    46
11 2013-01-12    47
12 2013-01-13    50
13 2013-01-14    56
14 2013-01-15    38
15 2013-01-16    37
16 2013-01-17    43
17 2013-01-18    35
18 2013-01-19    51
19 2013-01-20    53
20 2013-01-21    32
21 2013-01-22    27
22 2013-01-23    20
23 2013-01-24    22
24 2013-01-25    24
25 2013-01-26    27
26 2013-01-27    34
27 2013-01-28    36
28 2013-01-29    49
29 2013-01-30    59
30 2013-01-31    61

In [48]:
monthly_leaks = pd.DataFrame(month_data.groupby('Date')['TMAX'].count())
monthly_leaks = monthly_leaks.to_dict()
monthly_leaks['TMAX']

{Timestamp('2013-01-01 00:00:00'): 35,
 Timestamp('2013-01-02 00:00:00'): 46,
 Timestamp('2013-01-03 00:00:00'): 44,
 Timestamp('2013-01-04 00:00:00'): 33,
 Timestamp('2013-01-05 00:00:00'): 53,
 Timestamp('2013-01-06 00:00:00'): 42,
 Timestamp('2013-01-07 00:00:00'): 55,
 Timestamp('2013-01-08 00:00:00'): 40,
 Timestamp('2013-01-09 00:00:00'): 35,
 Timestamp('2013-01-10 00:00:00'): 40,
 Timestamp('2013-01-11 00:00:00'): 50,
 Timestamp('2013-01-12 00:00:00'): 34,
 Timestamp('2013-01-13 00:00:00'): 33,
 Timestamp('2013-01-14 00:00:00'): 48,
 Timestamp('2013-01-15 00:00:00'): 43,
 Timestamp('2013-01-16 00:00:00'): 40,
 Timestamp('2013-01-17 00:00:00'): 40,
 Timestamp('2013-01-18 00:00:00'): 30,
 Timestamp('2013-01-19 00:00:00'): 45,
 Timestamp('2013-01-20 00:00:00'): 30,
 Timestamp('2013-01-21 00:00:00'): 40,
 Timestamp('2013-01-22 00:00:00'): 35,
 Timestamp('2013-01-23 00:00:00'): 43,
 Timestamp('2013-01-24 00:00:00'): 60,
 Timestamp('2013-01-25 00:00:00'): 51,
 Timestamp('2013-01-26 00:00:00'): 30,
 Timestamp('2013-01-27 00:00:00'): 40,
 Timestamp('2013-01-28 00:00:00'): 39,
 Timestamp('2013-01-29 00:00:00'): 38,
 Timestamp('2013-01-30 00:00:00'): 48,
 Timestamp('2013-01-31 00:00:00'): 27}